src/cf/InformationRegisters/уатИсторияУстановкиЛимитовТопливныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатИсторияУстановкиЛимитовТопливныхКарт</Name>
			<Comment>Используется для хранения истории установки лимитов топливных карт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПластиковыеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомуВыдана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЛимита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыЛимитовТопливныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатТипыЛимитовТопливныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыЛимитовТопливныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоКоличеству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСумме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧислуТранзакций</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/уатИсторияУстановкиЛимитовТопливныхКарт/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() Тогда
		Если ЗначениеЗаполнено(Запись.Карта)
			И НЕ ЗначениеЗаполнено(Запись.КомуВыдана) Тогда
			Запись.КомуВыдана = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.Карта, "КомуВыдана");
		КонецЕсли;
	КонецЕсли;  
	флДоступностьПримененияЛимитов = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("уатПрименениеЛимитовТопливныхКарт");

	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЛимитаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КартаПриИзменении(Элемент)
	Запись.КомуВыдана = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.Карта, "КомуВыдана"); 
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрименитьЛимит(Команда)
	ПрименитьЛимитСервер();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура УстановитьВидимость()
	Если НЕ ЗначениеЗаполнено(Запись.ТипЛимита) Тогда
		Запись.ТипЛимита = Перечисления.уатТипыЛимитовТопливныхКарт.ПоКоличеству;
	КонецЕсли;
	Элементы.ГруппаЕдиницаИзмерения.ТекущаяСтраница = 
		?(Запись.ТипЛимита = Перечисления.уатТипыЛимитовТопливныхКарт.ПоСумме,
		Элементы.ГруппаВалюта, Элементы.ГруппаЛитры);   
	Если Запись.ТипЛимита = Перечисления.уатТипыЛимитовТопливныхКарт.ПоСумме Тогда
		Если НЕ ЗначениеЗаполнено(Запись.Валюта) Тогда
			Запись.Валюта = Константы.ВалютаУправленческогоУчета.Получить(); 
		КонецЕсли; 
	Иначе  
		Запись.Валюта = Неопределено;
	КонецЕсли;
	АЗС              = Запись.Карта.КемВыдана;
	Если ТипЗнч(АЗС) = Тип("СправочникСсылка.уатАЗС") Тогда
		УчетнаяЗаписьПЦ = АЗС.УчетнаяЗаписьПЦ;
		Элементы.ФормаПрименитьЛимит.Видимость   = УчетнаяЗаписьПЦ.ВнешняяСистема = Справочники.уатВнешниеСистемы.Газпромнефть;
		Элементы.ФормаПрименитьЛимит.Доступность = флДоступностьПримененияЛимитов;
	Иначе
		Элементы.ФормаПрименитьЛимит.Видимость = Ложь;  
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьЛимитСервер()
	АЗС = Запись.Карта.КемВыдана;
	Если ТипЗнч(АЗС) <> Тип("СправочникСсылка.уатАЗС") 
		И ЗначениеЗаполнено(Запись.Карта.IDкарты) Тогда
		Возврат;
	КонецЕсли;
	
	Комментарий = СтрШаблон(Нстр("ru = 'Применение лимита топливной карты. Лимит: %1'; en = 'Applying fuel card limit. Limit: %1'"), Запись.Лимит);
	ЗаписьЖурналаРегистрации(НСтр("en = 'Application of limits on fuel cards'; ru = 'Применение лимитов топливных карт'"),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.уатПластиковыеКарты,
		Запись.Карта,
		Комментарий);
		
	УчетнаяЗаписьПЦ = АЗС.УчетнаяЗаписьПЦ;
	
	ТекстОшибки = "";
	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);
	Выполнено   = уатЗагрузкаПЦ.Газпромнефть_ПрименитьЛимит(СтруктураПараметровУчетнойЗаписи, Запись.Карта.IDкарты, Запись.Лимит, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		Комментарий = Нстр("ru = 'При установке лимита возникли ошибки: '; en = 'Errors occurred while setting the limit:'") + ТекстОшибки;
		
		ЗаписьЖурналаРегистрации(НСтр("en = 'Application of limits on fuel cards'; ru = 'Применение лимитов топливных карт'"),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.уатПластиковыеКарты,
		Запись.Карта,
		Комментарий);
		Возврат;
	КонецЕсли;
	
	Если Выполнено Тогда 
		Комментарий = Нстр("ru = 'Лимит успешно установлен.'; en = 'The limit has been set successfully.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Комментарий);
		
		ЗаписьЖурналаРегистрации(НСтр("en = 'Application of limits on fuel cards'; ru = 'Применение лимитов топливных карт'"),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.уатПластиковыеКарты,
		Запись.Карта,
		Комментарий);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
